<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
	<head>
		<title>Ответы на контрольные вопросы</title>
        <link href="../../css/style.css" rel="stylesheet">
        <script src="../../js/script.js"></script>
        <meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
    </head>
    <body onload="preConvert()">
        <div class = "content">
            <h1>Ответы на контрольные вопросы</h1>
            <h3>Первая глава</h3>
            <ol>
                <li>Нужно ли использовать точку с запятой в конце каждой конструкции? Нет, в Python это не обязательно</li>
                <li>Можно ли использовать более одного условия к цикле? Можно , например конструкцией elif</li>
                <li>Какие битовые операции можно совершить над целыми числами?Битовые операции

Над целыми числами также можно производить битовые операции

x | y

Побитовое или

x ^ y

Побитовое исключающее или

x & y

Побитовое и

x << n

Битовый сдвиг влево

x >> y

Битовый сдвиг вправо

~x

Инверсия битов
 </li>
                <li>Что включает в себя модуль math?более сложные математические функции</li>
                <li>Напишите программу-калькулятор для целых чисел.</li><p>
                    print("Ноль в качестве знака операции"<p>
      "\n завершит работу программы")<p>
while True:<p>
    s = input("Знак (+,-,*,/): ")<p>
    if s == '0':<p>
        break<p>
    if s in ('+', '-', '*', '/'):<p>
        x = float(input("x="))<p>
        y = float(input("y="))<p>
        if s == '+':
            print("%.2f" % (x+y))<p>
        elif s == '-':<p>
            print("%.2f" % (x-y))<p>
        elif s == '*':<p>
            print("%.2f" % (x*y))<p>
        elif s == '/':<p>
            if y != 0:<p>
                print("%.2f" % (x/y))<p>
            else:<p>
                print("Деление на ноль!")<p>
    else:<p>
        print("Неверный знак операции!")<p>
            </ol>
            <h3>Вторая глава</h3>
            <ol>
                <li>Что такое строка? Строка — базовый тип представляющий из себя неизменяемую последовательность символов</li>
                <li>К какой категории относятся строки?К категории неизменяемых последовательностей</li>
                <li>В чем главное достоинство строк в тройных ковычках?Главное достоинство строк в тройных кавычках в том, что их можно использовать для записи многострочных блоков текста</li>
                <li>Что такое список?Это упорядоченные изменяемые коллекции объектов произвольных типов (почти как массив, но типы могут отличаться).</li>
                <li>Как создать список при помощи литерала?Список можно создать </li><p>

>>><p>

>>> s = [] # Пустой список<p>

>>> l = ['s', 'p', ['isok'], 2]<p>

>>> s<p>

[]<p>

>>> l<p>

['s', 'p', ['isok'], 2]<p>

            </ol>
            <h3>Третья глава</h3>
            <ol>
                <li>Что такое словарь? Это неупорядоченные коллекции произвольных объектов с доступом по ключу.</li>
                <li>Что можно делать со словарями?То же самое, что и с другими объектами: встроенные функции, ключевые слова (например, циклы for и while), а также специальные методы словарей</li>
                <li>Как создать словарь с ключами? classmethod dict.fromkeys(seq[,value])</li>
                <li>Что такое множество? Это "контейнер", содержащий не повторяющиеся элементы в случайном порядке.</li>
                <li>Какие операции можно совершать над множеством?С множествами можно выполнять множество операций: находить объединение, пересечение, примеры описаны в параграфе</li>
                <li>В чем плюсы и минусы кортежа?Кортеж защищен от изменений, как намеренных (что плохо), так и случайных (что хорошо).</li>
                </li>
            </ol>
        </div>
	</body>
</html>